Revit 2027 API
MEPSystem.BaseEquipmentConnector Property
The connector within base equipment which is used to connect with system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Connector BaseEquipmentConnector { get; }
Public ReadOnly Property BaseEquipmentConnector As Connector
	Get
public:
property Connector^ BaseEquipmentConnector {
	Connector^ get ();
}
member BaseEquipmentConnector : Connector with get
Return Value
Connector
 Returns the connector which connects with the system within base equipment if base equipment has been assigned to system, otherwise returns null.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace